Tasks/Задачи_РКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>Задачи_РКД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИзменяетСтадию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Задачи_ПКД</v8:Type>
						<v8:Type>cfg:DocumentRef.Рекламации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомментария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/ТаймингЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТаймингЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СбросСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение,</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УвеличениеСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПриостановкаРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧ_Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧ_Проверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаЗадача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаЗадачаРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Замер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажПередача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеГЧ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисвоенНомерPDM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоМалярка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоМалярка2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОгрузкаЧастичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОтгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПодрядчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПодрядчик2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоУпаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазработкаРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РКД_ожидание_согласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеЭлемента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стоп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВнешнееОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВнутреннееОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗРекламация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезИзмененияКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСВнешнегоДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеКонструктора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДизайнерскийКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаДизайнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеПроверкиВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаДизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеВнешнегоСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтвержденияВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеФиндиректором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзделия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаКонструктором</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗадачКонструирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЗадачКонструирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводствоГотово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводствоОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерИзменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерПроектный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерРабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерСоздан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Менеджер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Финдиректор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/Задачи_РКД/Ext/ManagerModule.bsl
Функция ДействияНаСервере(Действие, Задача, Параметр = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	стДанные 			= Неопределено;
	ОбъектЗадачаИзменен = Ложь;
	МенеджерРегистра 	= РегистрыСведений.ТаймингЗадач;

	Если Действие = "История" Тогда
		Возврат МенеджерРегистра.ПолучитьИсториюЗадачи(Задача);
	КонецЕсли;
	
	ОбъектЗадача 				= Задача.ПолучитьОбъект(); 
	Если НЕ ЗначениеЗаполнено(ОбъектЗадача.СтатусЗадачи) Тогда
		
		ОбъектЗадача.СтатусЗадачи = Перечисления.СтатусыЗадач.РазработкаРКД;	
		
	КонецЕсли;
	
	Если Действие = "НачатьВыполнение" Тогда 
		
		стДанные 				= МенеджерРегистра.ПолучитьСтруктуруДанных();
		стДанные.Состояние 		= Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		стДанные.Исполнитель	= омСотрудники.ПолучитьКонструктораРазработки(Задача); 
		
		Если ОбъектЗадача.СтатусЗадачи = Перечисления.СтатусыЗадач.ГЧ_Ожидание Тогда
			ОбъектЗадача.СтатусЗадачи = Перечисления.СтатусыЗадач.ГЧ_Проверка;	
		КонецЕсли;
		
	ИначеЕсли Действие = "СбросДизайнеромКорректировкаДизайнера" ИЛИ Действие = "СбросДизайнеромИзменениеЗаказчиком" Тогда
		
		СтатусыДействия = омЗадачиПКДСервер.ПолучитьСтатусЗадачиПоДействию(Действие);
		
		ОбъектЗадача.Исполнитель 		= омСотрудники.ПолучитьКонструктораРазработки(Задача);
		ОбъектЗадача.СтатусЗадачи		= СтатусыДействия.Статус;		
		ОбъектЗадача.ТипЗадачи			= СтатусыДействия.Тип;
		ОбъектЗадача.НеИзменяетСтадию	= Ложь;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, ОбъектЗадача.Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		
		Если омКанбанПроизводство.РесурсВПроизводстве(ОбъектЗадача.ОбъектТЗ) Тогда
			
			УИДКарточка = "";
			омКанбанПроизводство.ПеревестиКарточкуВПриостановку(ОбъектЗадача.ОбъектТЗ, , УИДКарточка);
			омКанбанДоскиНаСервере.ЗаписатьТег(Справочники.Теги.Пересогласование, УИДКарточка);
			
		КонецЕсли;
		
	ИначеЕсли Действие = "ПереносВ_ПКД_ДизайнеромКорректировкаДизайнера" ИЛИ Действие = "ПереносВ_ПКД_ДизайнеромИзменениеЗаказчиком" Тогда    

		
		КомпозицияКомплекта = омИзделиеКомплект.КомплектЧастьКомпозиции(ОбъектЗадача.ОбъектТЗ);
		
		Если ЗначениеЗаполнено(КомпозицияКомплекта) Тогда
		
			Задачи.ПересогласованиеКомпозиции.СоздатьЗадачуПересоглосования(КомпозицияКомплекта, Действие);		
		
		Иначе
			
			ОбъектЗадачаИзменен = Истина;
			
			СтатусыДействия = омЗадачиПКДСервер.ПолучитьСтатусЗадачиПоДействию(Действие, Истина);
			
			ОбъектТЗ = омЗадачиРКДНаСервере.ЗакрытьЗадачуРКД(Задача, стДанные, "Закрыта на пересогласование");
			
			стПараметры = омЗадачиПКДСервер.ПолучитьСтркутуркДляСозданияПКД(ОбъектТЗ, ОбъектЗадача.Проект); 
			
			стПараметры.Вставить("Статус", 		СтатусыДействия.Статус);
			стПараметры.Вставить("Состояние", 	Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
			стПараметры.Вставить("ТипЗадачи", 	СтатусыДействия.Тип);
			
			СсылкаНаЗадачу 	= омЗадачиПКДСервер.СоздатьЗадачуПКД(ОбъектТЗ, ОбъектЗадача.Исполнитель, стПараметры);
			
		КонецЕсли;
		
	ИначеЕсли Действие = "СбросКонструктором" Тогда
		
		ОбъектЗадача.Исполнитель = омСотрудники.ПолучитьКонструктораРазработки(ОбъектЗадача.Ссылка);
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеКонструктором, ОбъектЗадача.Исполнитель, ОбъектЗадача.СтатусЗадачи, ОбъектЗадача.ТипЗадачи);
		
	ИначеЕсли Действие = "Приостановить" Тогда
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПриостановкаКонструктором);
	ИначеЕсли Действие = "ЗавершениеРаботы" Тогда
		
		ВедущийКонструктор = омСотрудники.СотрудникиОбъекта(ОбъектЗадача.ОбъектТЗ).ВедущийКонструктор;
		
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ВедущийКонструктор;
		ОбъектЗадача.Исполнитель 	= ВедущийКонструктор;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором);
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		
	ИначеЕсли Действие = "ДоработкаВедущийКонструктор" Тогда
		омЗадачиРКДНаСервере.ПеревестиЗадачуВОжидание(Задача, , стДанные);
		ОбъектЗадачаИзменен = Истина;
	ИначеЕсли Действие = "ОжиданиеСогласования" Тогда
		омЗадачиРКДНаСервере.ПеревестиЗадачуВОжиданиеСогласования(Задача);
		ОбъектЗадачаИзменен = Истина;
	ИначеЕсли Действие = "Утверждение" Тогда
		омЗадачиРКДНаСервере.ЗавершениеЗадачиРКД(Задача, стДанные);	
		ОбъектЗадачаИзменен = Истина;
	ИначеЕсли Действие = "ОжиданиеГЧ" Тогда
		
		Конструктор = омСотрудники.ПолучитьКонструктораРазработки(Задача);
		
		ОбъектЗадача 				= Задача.ПолучитьОбъект();
		ОбъектЗадача.Дата			= ТекущаяДата();
		ОбъектЗадача.СтатусЗадачи	= Перечисления.СтатусыЗадач.ОжиданиеГЧ;
		ОбъектЗадача.ТипЗадачи 		= Перечисления.ТипыЗадачКонструирования.ПустаяСсылка();
		ОбъектЗадача.Исполнитель 	= Конструктор;
		
		стДанные = МенеджерРегистра.ПолучитьСтруктуруДанных(Перечисления.СостоянияЗадач.ПустаяСсылка());
		стДанные.ТипЗадачи 		= ОбъектЗадача.ТипЗадачи;
		стДанные.Исполнитель 	= ОбъектЗадача.Исполнитель;
		стДанные.Статус 		= ОбъектЗадача.СтатусЗадачи;
		
	КонецЕсли;
	
	НаименованиеПараметра 	= "";
	МодульСчетчиков 		= Обработки.НастройкаДействий;
	ОбъектЗадачаИзменен 	= МодульСчетчиков.ИзменитьСчетчикСобытий(Задача, Действие, "РКД", НаименованиеПараметра, Ложь) ИЛИ ОбъектЗадачаИзменен; 
	
	НовоеСостояние 	= Неопределено;
	НовыйТип 		= Неопределено;
	НовыЙСтатус 	= Неопределено;

	Если стДанные = Неопределено Тогда
		НовыйТип 		= ОбъектЗадача.ТипЗадачи;
		НовыЙСтатус 	= ОбъектЗадача.СтатусЗадачи;
	Иначе
		
		ЗначениеИзменениеСчетчика = 0;
		
		Если НаименованиеПараметра = "НомерДоработка" Тогда
			ЗначениеИзменениеСчетчика = ЗначениеИзменениеСчетчика + 1;
		ИначеЕсли НаименованиеПараметра = "НомерКорректировка" Тогда
			ЗначениеИзменениеСчетчика = ЗначениеИзменениеСчетчика + 2;
		ИначеЕсли НаименованиеПараметра = "НомерИзменение" Тогда
			ЗначениеИзменениеСчетчика = ЗначениеИзменениеСчетчика + 4;
		КонецЕсли;
		
		стДанные.УвеличениеСчетчика = ЗначениеИзменениеСчетчика; 
		
		МенеджерРегистра.УстановитьСостояниеИсполнительЗадачи(Задача, стДанные); 
		НовоеСостояние 	= стДанные.Состояние;
		НовыйТип 		= стДанные.ТипЗадачи;
		НовыЙСтатус 	= стДанные.Статус;
		
	КонецЕсли;
	
	Если НЕ ОбъектЗадачаИзменен Тогда
		
		ОбъектЗадача.Наименование = омЗадачиОбщие.ПолучитьНаименованиеЗадачи(Задача, НовыЙСтатус, НовыйТип, НовоеСостояние);
		ОбъектЗадача.Записать();
		
	КонецЕсли;
	
	Если НЕ ОбъектЗадача.НеИзменяетСтадию Тогда
		омЗадачиПКДСервер.УстановитьСтадиюКомплекта(Задача);
	КонецЕсли;
	
	Возврат РегистрыСведений.ТаймингЗадач.ПолучитьСостояниеЗадачи(Задача);
	
КонецФункции // ДействияНаСервере()
